---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.Dispose
source: html/1fba9ff6-d5b4-937b-10fb-9d50b71c9e9a.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.Dispose Method

Releases all resources used by the RebarFreeFormAccessor

## Syntax (C#)
```csharp
public void Dispose()
```